package cn.homework;

public class HomeWork02 {
	public static void main(String[] args) {
		/*(1)定义一个存放手机号码的数字字符串数组{"16210626656","18601066888","13912387666","13156166693","15115888028"}
		(2)利用正则表达式过滤出符合条件的手机号码，
			规则：第1位是1，第二位可以是数字358其中之一，后面6位任意数字，最后3位为任意相同的数字。
		(3)如：18601066888 13912387666*/
      String [] str = {"16210626656","18601066888","139123876rrr","13156166693","15115888028"};
      for (String thisStr : str) {
    	  if(thisStr.matches("[1][358][\\d]{6}(\\d)\\1{2}")){
    		    // () -->抽取出来匹配项
    		    //   \\数字  --->指向抽取出来的匹配项
    		    //  \\D 非数字
    		    // [1][358][\\d]{6}(\\d)(\\D)\\2{2}
    		    System.out.println(thisStr);
    	  }
	 }
	}
}
